; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v12 ?v13)
             (pred_7 ?v4 ?v11)
             (pred_10 ?v12 ?v11)
             (pred_4 ?v2 ?v12 )
	     (pred_11 ?v12)
             (pred_8 ?v8)
             (pred_3 ?v4)
             (pred_9 ?v11)
             (pred_1 ?v12)
             (pred_12 ?v4)
             (pred_2 ?v12)
             (pred_5 ))



(:action op_4
:parameters (?v3 ?v6 ?v7 ?v10)
:precondition (and (pred_8 ?v3) (pred_8 ?v6) (pred_3 ?v7) (pred_9 ?v10)
          (pred_6 ?v3 ?v6) (pred_7 ?v7 ?v10)
                   (pred_10 ?v6 ?v10) (pred_11 ?v3) 
                   (pred_1 ?v6) (pred_12 ?v7))
:effect (and  (pred_2 ?v6) (not (pred_1 ?v6))))


(:action op_3
:parameters (?v3 ?v1)
:precondition (and (pred_8 ?v3) (pred_8 ?v1)
               (pred_11 ?v3) (pred_6 ?v3 ?v1) (pred_2 ?v1))
:effect (and (pred_11 ?v1) (not (pred_11 ?v3))))

(:action op_2
:parameters (?v3 ?v7)
:precondition (and (pred_8 ?v3) (pred_3 ?v7) 
                  (pred_11 ?v3) (pred_4 ?v7 ?v3) (pred_5 ))
:effect (and (pred_12 ?v7)
   (not (pred_4 ?v7 ?v3)) (not (pred_5 ))))


(:action op_1
:parameters (?v3 ?v9 ?v5)
:precondition (and (pred_8 ?v3) (pred_3 ?v9) (pred_3 ?v5)
                  (pred_11 ?v3) (pred_12 ?v5) (pred_4 ?v9 ?v3))
:effect (and (pred_12 ?v9) (pred_4 ?v5 ?v3)
        (not (pred_12 ?v5)) (not (pred_4 ?v9 ?v3))))

(:action op_5
:parameters (?v3 ?v7)
:precondition (and (pred_8 ?v3) (pred_3 ?v7) 
                  (pred_11 ?v3) (pred_12 ?v7))
:effect (and (pred_5 ) (pred_4 ?v7 ?v3) (not (pred_12 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_29 obj_10 obj_15 obj_27 obj_22 obj_07 obj_23 obj_13 obj_19 obj_02 obj_03 obj_26 obj_12 obj_11 obj_01 obj_04 obj_16 obj_14 obj_21 obj_18 obj_31 obj_09 obj_06 obj_30
    obj_25 obj_17 obj_20
    obj_05 obj_24 obj_28
    )

    (:init
       (pred_5)

       (pred_8 obj_08)
       (pred_8 obj_29)
       (pred_8 obj_10)
       (pred_8 obj_15)
       (pred_8 obj_27)
       (pred_8 obj_22)
       (pred_8 obj_07)
       (pred_8 obj_23)
       (pred_8 obj_13)
       (pred_8 obj_19)
       (pred_8 obj_02)
       (pred_8 obj_03)
       (pred_8 obj_26)
       (pred_8 obj_12)
       (pred_8 obj_11)
       (pred_8 obj_01)
       (pred_8 obj_04)
       (pred_8 obj_16)
       (pred_8 obj_14)
       (pred_8 obj_21)
       (pred_8 obj_18)
       (pred_8 obj_31)
       (pred_8 obj_09)
       (pred_8 obj_06)
       (pred_8 obj_30)
       (pred_9 obj_25)
       (pred_9 obj_17)
       (pred_9 obj_20)
       (pred_3 obj_05)
       (pred_3 obj_24)
       (pred_3 obj_28)

       (pred_6 obj_08 obj_22)
       (pred_6 obj_08 obj_29)
       (pred_6 obj_29 obj_07)
       (pred_6 obj_29 obj_10)
       (pred_6 obj_29 obj_08)
       (pred_6 obj_10 obj_23)
       (pred_6 obj_10 obj_15)
       (pred_6 obj_10 obj_29)
       (pred_6 obj_15 obj_13)
       (pred_6 obj_15 obj_27)
       (pred_6 obj_15 obj_10)
       (pred_6 obj_27 obj_19)
       (pred_6 obj_27 obj_15)
       (pred_6 obj_22 obj_02)
       (pred_6 obj_22 obj_07)
       (pred_6 obj_22 obj_08)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_23)
       (pred_6 obj_07 obj_29)
       (pred_6 obj_07 obj_22)
       (pred_6 obj_23 obj_26)
       (pred_6 obj_23 obj_13)
       (pred_6 obj_23 obj_10)
       (pred_6 obj_23 obj_07)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_19)
       (pred_6 obj_13 obj_15)
       (pred_6 obj_13 obj_23)
       (pred_6 obj_19 obj_11)
       (pred_6 obj_19 obj_27)
       (pred_6 obj_19 obj_13)
       (pred_6 obj_02 obj_01)
       (pred_6 obj_02 obj_03)
       (pred_6 obj_02 obj_22)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_26)
       (pred_6 obj_03 obj_07)
       (pred_6 obj_03 obj_02)
       (pred_6 obj_26 obj_16)
       (pred_6 obj_26 obj_12)
       (pred_6 obj_26 obj_23)
       (pred_6 obj_26 obj_03)
       (pred_6 obj_12 obj_14)
       (pred_6 obj_12 obj_11)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_12 obj_26)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_11 obj_19)
       (pred_6 obj_11 obj_12)
       (pred_6 obj_01 obj_18)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_01 obj_02)
       (pred_6 obj_04 obj_31)
       (pred_6 obj_04 obj_16)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_16 obj_09)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_16 obj_26)
       (pred_6 obj_16 obj_04)
       (pred_6 obj_14 obj_06)
       (pred_6 obj_14 obj_21)
       (pred_6 obj_14 obj_12)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_21 obj_30)
       (pred_6 obj_21 obj_11)
       (pred_6 obj_21 obj_14)
       (pred_6 obj_18 obj_31)
       (pred_6 obj_18 obj_01)
       (pred_6 obj_31 obj_09)
       (pred_6 obj_31 obj_04)
       (pred_6 obj_31 obj_18)
       (pred_6 obj_09 obj_06)
       (pred_6 obj_09 obj_16)
       (pred_6 obj_09 obj_31)
       (pred_6 obj_06 obj_30)
       (pred_6 obj_06 obj_14)
       (pred_6 obj_06 obj_09)
       (pred_6 obj_30 obj_21)
       (pred_6 obj_30 obj_06)
       (pred_1 obj_10)
       (pred_1 obj_18)
       (pred_1 obj_14)
       (pred_10  obj_10 obj_25)
       (pred_10  obj_18 obj_17)
       (pred_10  obj_14 obj_20)
       (pred_2 obj_08)
       (pred_2 obj_29)
       (pred_2 obj_15)
       (pred_2 obj_27)
       (pred_2 obj_22)
       (pred_2 obj_07)
       (pred_2 obj_23)
       (pred_2 obj_13)
       (pred_2 obj_19)
       (pred_2 obj_02)
       (pred_2 obj_03)
       (pred_2 obj_26)
       (pred_2 obj_12)
       (pred_2 obj_11)
       (pred_2 obj_01)
       (pred_2 obj_04)
       (pred_2 obj_16)
       (pred_2 obj_21)
       (pred_2 obj_31)
       (pred_2 obj_09)
       (pred_2 obj_06)
       (pred_2 obj_30)

       (pred_7  obj_05 obj_25)
       (pred_7  obj_24 obj_17)
       (pred_7  obj_28 obj_20)
       (pred_4 obj_05 obj_04)
       (pred_4 obj_24 obj_19)
       (pred_4 obj_28 obj_15)
       (pred_11 obj_13)
    )

    (:goal (and
       (pred_4 obj_05 obj_02)
       (pred_4 obj_28 obj_03)
    ))
(:constraints
  (always (not (pred_11 obj_23)))
)
)

; plan
1. (op_3 obj_13 obj_12)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_12)
   goals met: 0 of 2
2. (op_3 obj_12 obj_26)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_26)
   goals met: 0 of 2
3. (op_3 obj_26 obj_03)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_03)
   goals met: 0 of 2
4. (op_3 obj_03 obj_04)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_04)
   goals met: 0 of 2
5. (op_2 obj_04 obj_05)
   deleted: (pred_4 obj_05 obj_04) (pred_5)
   added: (pred_12 obj_05)
   goals met: 0 of 2
6. (op_3 obj_04 obj_03)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_03)
   goals met: 0 of 2
7. (op_3 obj_03 obj_02)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_02)
   goals met: 0 of 2
8. (op_5 obj_02 obj_05)
   deleted: (pred_12 obj_05)
   added: (pred_5) (pred_4 obj_05 obj_02)
   goals met: 1 of 2
9. (op_3 obj_02 obj_03)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_03)
   goals met: 1 of 2
10. (op_3 obj_03 obj_26)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_26)
   goals met: 1 of 2
11. (op_3 obj_26 obj_12)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_12)
   goals met: 1 of 2
12. (op_3 obj_12 obj_13)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_13)
   goals met: 1 of 2
13. (op_3 obj_13 obj_15)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_15)
   goals met: 1 of 2
14. (op_2 obj_15 obj_28)
   deleted: (pred_4 obj_28 obj_15) (pred_5)
   added: (pred_12 obj_28)
   goals met: 1 of 2
15. (op_3 obj_15 obj_13)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_13)
   goals met: 1 of 2
16. (op_3 obj_13 obj_12)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_12)
   goals met: 1 of 2
17. (op_3 obj_12 obj_26)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_26)
   goals met: 1 of 2
18. (op_3 obj_26 obj_03)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_03)
   goals met: 1 of 2
19. (op_5 obj_03 obj_28)
   deleted: (pred_12 obj_28)
   added: (pred_5) (pred_4 obj_28 obj_03)
   goals met: 2 of 2
